package Class;

//Написать метод equals, который определяет, равны ли между собой соответствующие элементы  2-х двумерных массивов.


/*public class eq {
        public static void main(String args[]) {
            String Str1 = "";
            String Str2 = Str1;
            String Str3 = new String("");
            boolean retVal;

            retVal = Str1.equals(Str2);
            System.out.println("Строка Str1 равна строке Str2? Ответ:" +
                    "   " + retVal );

            retVal = Str1.equals(Str3);
            System.out.println("Строка Str1 равна строке Str3? Ответ: " + retVal );
        }
    }
}*/
